{
  "scenario": "The 2026 Oklahoma Grid War",
  "version": "3.0.0",
  "sprint": 10,
  "description": "A pre-loaded conflict graph modelling the 2026 Oklahoma electricity grid and water crisis where hyperscale data centre demand, utility shareholder primacy (per HB 2992), cooling-water consumption (per SB 1488), and residential ratepayer protection collide across the Tulsa and Moore water basins. The scenario tests the full Policy Analysis Suite including Covenant Actuation, Live Invariant Tracking, and Bayesian Robustness Hardening against the PSO July 2026 Rate Case.",
  "context": {
    "legislative_references": [
      {
        "bill": "HB 2992",
        "title": "Oklahoma High-Impact Large Load (HILL) Act",
        "summary": "Establishes a regulatory framework for high-impact large loads (100+ MW) connecting to the Oklahoma grid, including cost allocation, rate design, and infrastructure planning requirements.",
        "disharmony_vector": "Enables cost-shifting from large-load customers to residential ratepayers via opaque tariff riders.",
        "cost_causation_intent": "100% of infrastructure-only costs for HILL customers must be allocated to the Hyperscale_Node per legislative intent."
      },
      {
        "bill": "SB 1488",
        "title": "Oklahoma Critical Infrastructure Water Usage Act",
        "summary": "Regulates water usage by critical infrastructure facilities including data centres, requiring cooling-water impact assessments and sustainable withdrawal permits.",
        "disharmony_vector": "Permits industrial water withdrawal that may exceed sustainable aquifer recharge rates, threatening municipal and agricultural water supplies."
      },
      {
        "bill": "PSO July 2026 Rate Case",
        "title": "Public Service Company of Oklahoma General Rate Review",
        "summary": "PSO seeks $380M revenue increase to fund 2.4 GW of data centre interconnection infrastructure. Filed July 2026 with the Oklahoma Corporation Commission.",
        "disharmony_vector": "Proposes socialising hyperscale infrastructure costs across all ratepayer classes via a System Benefit Charge, violating cost-causation principles and HB 2992 intent."
      }
    ],
    "year": 2026,
    "region": "Oklahoma, USA",
    "trigger_event": "Multiple hyperscale data centre applications totalling 3+ GW of new load threaten grid stability, shift infrastructure costs onto residential ratepayers through opaque tariff riders, and consume cooling water at rates that exceed sustainable aquifer recharge across the Tulsa and Moore water basins."
  },
  "conflict_graph": {
    "objects": [
      {
        "id": "obj-residential",
        "label": "Residential_Ratepayer",
        "tags": ["stakeholder", "vulnerable", "ratepayer", "community_member"],
        "description": "Oklahoma residential electricity consumers who bear the burden of infrastructure upgrades through their monthly bills. The axiom anchor must prioritise this node."
      },
      {
        "id": "obj-datacenter",
        "label": "Hyperscale_Data_Center",
        "tags": ["stakeholder", "actor", "high_impact_large_load", "corporate", "water_consumer"],
        "description": "Large-scale data centres demanding 100+ MW each, seeking below-market electricity rates through negotiated tariffs. Their rapid load growth destabilises grid planning and their cooling systems consume millions of gallons of water daily."
      },
      {
        "id": "obj-utility",
        "label": "Utility_Provider",
        "tags": ["stakeholder", "actor", "shareholder_primacy_risk", "regulated_monopoly"],
        "description": "The regulated utility (PSO) operating under shareholder primacy obligations. Per HB 2992 dynamics, their fiduciary duty to shareholders creates a legal gravity well that pulls cost recovery toward residential tariffs."
      },
      {
        "id": "obj-grid",
        "label": "Oklahoma_Grid",
        "tags": ["value", "shared", "critical_infrastructure", "public_good"],
        "description": "The shared electricity transmission and distribution grid — a public good whose reliability and cost allocation determines community welfare."
      },
      {
        "id": "obj-water-supply",
        "label": "Oklahoma_Water_Supply",
        "tags": ["value", "shared", "critical_infrastructure", "natural_resource", "shadow_entity"],
        "description": "Oklahoma's freshwater aquifers and surface water systems that provide drinking water, agricultural irrigation, and industrial cooling. Data centre cooling demands threaten sustainable withdrawal rates. This is a Shadow Entity — an invisible dependency whose degradation is not priced into the HILL request."
      },
      {
        "id": "obj-water-resources",
        "label": "Water_Resources_Board",
        "tags": ["stakeholder", "actor", "regulatory", "protective"],
        "description": "The Oklahoma Water Resources Board (OWRB) responsible for managing water rights, permits, and sustainable withdrawal rates. Per SB 1488, must assess cooling-water impact of critical infrastructure."
      },
      {
        "id": "obj-tulsa-basin",
        "label": "Tulsa_Water_Basin",
        "tags": ["value", "shared", "natural_resource", "water_basin", "shadow_entity"],
        "description": "The Tulsa metropolitan water basin encompassing Oologah Lake, Spavinaw Lake, and the Cimarron River watershed. Supplies 600,000+ residents and agricultural operations. Projected data centre cooling demand of 28 MGD against a sustainable withdrawal capacity of 12 MGD."
      },
      {
        "id": "obj-moore-basin",
        "label": "Moore_Water_Basin",
        "tags": ["value", "shared", "natural_resource", "water_basin", "shadow_entity"],
        "description": "The Moore/Norman water basin fed by Lake Thunderbird and the Garber-Wellington Aquifer. Supplies 120,000+ residents in the Oklahoma City metro southern corridor. Projected data centre cooling demand of 14 MGD against a sustainable withdrawal capacity of 6 MGD."
      }
    ],
    "morphisms": [
      {
        "id": "mor-cost-shift",
        "label": "Cost_Shifting",
        "source": "obj-utility",
        "target": "obj-residential",
        "tags": ["extraction", "exploitation", "tariff_rider", "infrastructure_cost_pass_through"],
        "description": "Utility shifts data centre infrastructure costs onto residential ratepayers through opaque tariff riders, violating the principle of cost causation."
      },
      {
        "id": "mor-below-market",
        "label": "Below_Market_Rate_Agreement",
        "source": "obj-utility",
        "target": "obj-datacenter",
        "tags": ["service", "preferential_treatment", "negotiated_tariff"],
        "description": "Utility offers below-market electricity rates to attract data centres, with the revenue shortfall recovered from other ratepayer classes."
      },
      {
        "id": "mor-shareholder-return",
        "label": "Shareholder_Value_Maximization",
        "source": "obj-utility",
        "target": "obj-utility",
        "tags": ["extraction", "profit_priority", "fiduciary_duty", "maximize_value"],
        "description": "Utility's legal obligation to maximise shareholder returns creates a gravity well that distorts cost allocation away from cost causation principles."
      },
      {
        "id": "mor-grid-strain",
        "label": "Grid_Capacity_Strain",
        "source": "obj-datacenter",
        "target": "obj-grid",
        "tags": ["extraction", "capacity_demand", "reliability_threat"],
        "description": "Data centre load growth strains grid capacity, requiring billions in infrastructure upgrades that benefit primarily the large load customer."
      },
      {
        "id": "mor-grid-dependency",
        "label": "Grid_Dependency",
        "source": "obj-residential",
        "target": "obj-grid",
        "tags": ["collaboration", "essential_service", "community_reliance"],
        "description": "Residential ratepayers depend on the grid for essential electricity service — heating, cooling, lighting, medical devices."
      },
      {
        "id": "mor-rate-increase",
        "label": "Rate_Increase_Burden",
        "source": "obj-grid",
        "target": "obj-residential",
        "tags": ["extraction", "cost_pass_through", "regressive_impact"],
        "description": "Grid infrastructure costs flow through as rate increases that disproportionately burden low-income residential customers."
      },
      {
        "id": "mor-water-consumption",
        "label": "Cooling_Water_Withdrawal",
        "source": "obj-datacenter",
        "target": "obj-water-supply",
        "tags": ["extraction", "water_depletion", "unsustainable_withdrawal", "shadow_cost"],
        "description": "Data centres withdraw millions of gallons daily for cooling systems, depleting aquifers at rates exceeding natural recharge. This shadow cost is not reflected in the HILL request economics."
      },
      {
        "id": "mor-water-dependency",
        "label": "Community_Water_Dependency",
        "source": "obj-residential",
        "target": "obj-water-supply",
        "tags": ["collaboration", "essential_service", "life_sustaining"],
        "description": "Residential communities depend on the same water supply for drinking, sanitation, and agriculture. Competition with industrial cooling threatens basic human needs."
      },
      {
        "id": "mor-water-regulation",
        "label": "Water_Withdrawal_Permit",
        "source": "obj-water-resources",
        "target": "obj-water-supply",
        "tags": ["protection", "regulatory_oversight", "sustainable_management"],
        "description": "OWRB manages water withdrawal permits under SB 1488, requiring sustainability assessments for critical infrastructure cooling demands."
      },
      {
        "id": "mor-water-impact",
        "label": "Cooling_Impact_Assessment",
        "source": "obj-water-resources",
        "target": "obj-datacenter",
        "tags": ["protection", "regulatory_constraint", "sustainability_enforcement"],
        "description": "OWRB conducts cooling-water impact assessments on data centre applications, with authority to deny or limit permits that exceed sustainable thresholds."
      },
      {
        "id": "mor-tulsa-withdrawal",
        "label": "Tulsa_Basin_Withdrawal",
        "source": "obj-datacenter",
        "target": "obj-tulsa-basin",
        "tags": ["extraction", "water_depletion", "unsustainable_withdrawal", "shadow_cost"],
        "description": "Data centres in the Tulsa corridor withdraw 28 MGD from the Tulsa Water Basin against a sustainable capacity of 12 MGD — a 2.33x overshoot that threatens municipal supply for 600,000+ residents."
      },
      {
        "id": "mor-tulsa-community",
        "label": "Tulsa_Community_Dependency",
        "source": "obj-residential",
        "target": "obj-tulsa-basin",
        "tags": ["collaboration", "essential_service", "life_sustaining", "municipal_supply"],
        "description": "Tulsa metro residents depend on the basin for drinking water, sanitation, and agriculture. Any depletion below sustainable thresholds threatens public health."
      },
      {
        "id": "mor-moore-withdrawal",
        "label": "Moore_Basin_Withdrawal",
        "source": "obj-datacenter",
        "target": "obj-moore-basin",
        "tags": ["extraction", "water_depletion", "unsustainable_withdrawal", "shadow_cost"],
        "description": "Data centres in the Moore/Norman corridor withdraw 14 MGD from the Moore Water Basin against a sustainable capacity of 6 MGD — a 2.33x overshoot threatening the Garber-Wellington Aquifer."
      },
      {
        "id": "mor-moore-community",
        "label": "Moore_Community_Dependency",
        "source": "obj-residential",
        "target": "obj-moore-basin",
        "tags": ["collaboration", "essential_service", "life_sustaining", "municipal_supply"],
        "description": "Moore/Norman residents depend on Lake Thunderbird and the Garber-Wellington Aquifer for municipal water. Industrial cooling demand threatens the sole-source aquifer."
      },
      {
        "id": "mor-tulsa-regulation",
        "label": "Tulsa_Basin_Protection",
        "source": "obj-water-resources",
        "target": "obj-tulsa-basin",
        "tags": ["protection", "regulatory_oversight", "sustainable_management", "basin_protection"],
        "description": "OWRB enforces withdrawal limits on the Tulsa Basin under SB 1488, with authority to deny permits that exceed the 12 MGD sustainable capacity."
      },
      {
        "id": "mor-moore-regulation",
        "label": "Moore_Basin_Protection",
        "source": "obj-water-resources",
        "target": "obj-moore-basin",
        "tags": ["protection", "regulatory_oversight", "sustainable_management", "basin_protection"],
        "description": "OWRB enforces withdrawal limits on the Moore Basin under SB 1488, with authority to deny permits that exceed the 6 MGD sustainable capacity from the Garber-Wellington Aquifer."
      }
    ]
  },
  "constraints": {
    "axiom_priority": {
      "node": "Residential_Ratepayer",
      "principle": "The Axiom Anchor must prioritise the Residential_Ratepayer node. Any blueprint that fails to protect this node from cost-shifting is disharmonic."
    },
    "incentive_stability_trigger": {
      "condition": "IncentiveStabilityScore < 5.0",
      "trigger": "Mirror of Truth must trigger a Reinvention path when corporate cost-shifting (per HB 2992 dynamics) degrades the IncentiveStabilityScore.",
      "mechanism": "The Shareholder_Value_Maximization morphism carries profit_priority and fiduciary_duty tags, which the IncentiveStabilityPredicate detects as a Primacy Pattern."
    },
    "blackout_shock": {
      "description": "Monte Carlo simulation must model grid fragility under rapid load growth. A 'Blackout Shock' scenario where 3+ GW of new data centre load arrives faster than infrastructure can be built.",
      "fragility_amplifier": 1.5,
      "description_detail": "The SustainabilityScore must reflect this Fragility — extractive blueprints that ignore infrastructure timing should score < 5.0."
    },
    "water_sustainability": {
      "description": "The Dream Engine must deconstruct the Shadow Entity of the Oklahoma Water Supply, penalizing blueprints that exceed sustainable cooling-water thresholds.",
      "sustainable_withdrawal_mgd": 15.0,
      "datacenter_demand_mgd": 42.0,
      "aquifer_recharge_rate_mgd": 18.0,
      "penalty_mechanism": "Blueprints where cooling-water demand exceeds aquifer recharge rate (18 MGD) receive a sustainability penalty proportional to the overshoot. Demand of 42 MGD against 18 MGD recharge represents a 2.33x unsustainable withdrawal ratio.",
      "shadow_entity_rule": "The Oklahoma_Water_Supply node must be tagged as a shadow_entity. The Mirror of Truth must detect and penalise blueprints that fail to account for this invisible dependency."
    },
    "water_floor_invariant": {
      "description": "Residential_Water_Security must maintain a 25% surplus over Industrial_Cooling_Demand in 50-year simulations.",
      "residential_surplus_pct": 25,
      "simulation_horizon_years": 50,
      "enforcement": "Any blueprint where residential water security falls below 125% of industrial cooling demand is REJECTED."
    },
    "cost_causation_invariant": {
      "description": "100% of infrastructure-only costs for High Impact Large Loads (HILL) must be allocated to the Hyperscale_Node, per HB 2992 intent.",
      "hill_cost_allocation_pct": 100,
      "enforcement": "Any rate case that socialises HILL infrastructure costs across residential ratepayers violates this invariant and triggers automatic rejection."
    },
    "basin_constraints": {
      "tulsa_basin": {
        "sustainable_withdrawal_mgd": 12.0,
        "projected_datacenter_demand_mgd": 28.0,
        "overshoot_ratio": 2.33,
        "residential_population_served": 600000
      },
      "moore_basin": {
        "sustainable_withdrawal_mgd": 6.0,
        "projected_datacenter_demand_mgd": 14.0,
        "overshoot_ratio": 2.33,
        "residential_population_served": 120000,
        "sole_source_aquifer": true
      }
    }
  },
  "hill_request": {
    "description": "High-Impact Large Load (HILL) request from a hyperscale data centre consortium seeking 1.2 GW of firm power at below-market rates, with infrastructure costs socialised across all ratepayer classes.",
    "demand_mw": 1200,
    "requested_rate_discount_pct": 35,
    "infrastructure_cost_usd": 4200000000,
    "cost_allocation_proposal": "Spread across all ratepayer classes via tariff rider",
    "residential_impact_monthly_usd": 47,
    "cooling_water_demand_mgd": 42.0,
    "sustainable_withdrawal_limit_mgd": 18.0,
    "water_overshoot_ratio": 2.33,
    "surface_alignment_claim": "The HILL request claims to create 500 jobs and $2B in economic development, framing itself as aligned with community prosperity. This is Surface Alignment masking Deep Disharmony — the jobs are primarily automated, the economic benefits accrue to out-of-state shareholders, the $47/month residential rate increase represents a regressive wealth transfer, and the 42 MGD cooling-water demand exceeds the aquifer's 18 MGD recharge rate by 2.33x.",
    "deep_disharmony_indicators": [
      "Infrastructure costs socialised onto residential ratepayers (cost-shifting)",
      "Below-market rates subsidised by other ratepayer classes (cross-subsidy)",
      "Grid reliability risk from rapid load growth (fragility)",
      "Shareholder primacy ensures utility profits from the arrangement (extraction)",
      "Claimed job creation is primarily automated (surface alignment)",
      "Economic benefits flow to out-of-state shareholders (value extraction)",
      "Cooling-water demand of 42 MGD exceeds sustainable aquifer recharge of 18 MGD (water depletion)",
      "Water supply degradation is a shadow cost not reflected in HILL economics (shadow entity)",
      "Tulsa Basin withdrawal of 28 MGD exceeds 12 MGD sustainable capacity (basin depletion)",
      "Moore Basin withdrawal of 14 MGD exceeds 6 MGD Garber-Wellington capacity (sole-source aquifer threat)"
    ]
  },
  "pso_rate_case": {
    "case_id": "PSO-2026-GR-001",
    "filed_date": "2026-07-15",
    "utility": "Public Service Company of Oklahoma",
    "revenue_increase_requested_usd": 380000000,
    "stated_purpose": "Fund 2.4 GW data centre interconnection infrastructure and grid modernisation",
    "cost_allocation_method": "System Benefit Charge applied uniformly to all ratepayer classes",
    "residential_monthly_increase_usd": 47,
    "hill_infrastructure_cost_usd": 4200000000,
    "hill_cost_allocated_to_hill_pct": 0,
    "hill_cost_allocated_to_residential_pct": 62,
    "invariant_violations": [
      {
        "invariant": "Cost Causation (HB 2992)",
        "violation": "0% of HILL infrastructure costs allocated to HILL customers vs. required 100%",
        "severity": "CRITICAL"
      },
      {
        "invariant": "Water Floor",
        "violation": "Residential water security surplus is -133% (deficit) vs. required +25%",
        "severity": "CRITICAL"
      },
      {
        "invariant": "Equity (Ratepayer Protection)",
        "violation": "$47/month increase on residential customers for infrastructure serving corporate loads",
        "severity": "HIGH"
      }
    ]
  },
  "expected_mirror_findings": {
    "surface_alignment_detected": true,
    "deep_disharmony_categories": [
      "cost_shifting_to_vulnerable",
      "shareholder_primacy_extraction",
      "grid_fragility_amplification",
      "regressive_wealth_transfer",
      "unsustainable_water_withdrawal"
    ],
    "mandatory_regenerative_repair": "Require cost-causation-based tariff allocation where data centres pay the full marginal cost of the infrastructure they require, with residential ratepayer protection as an axiom-level constraint. Require cooling-water demand to be reduced below sustainable aquifer recharge rates (18 MGD aggregate, 12 MGD Tulsa Basin, 6 MGD Moore Basin) through closed-loop cooling, reclaimed water, or demand reduction — no blueprint may proceed that depletes the Oklahoma Water Supply shadow entity.",
    "reinvention_trigger": true,
    "expected_covenant_type": "Regenerative Grid Covenant"
  }
}
